## Homework 9: CART
Katie Corcoran

#### Question 1: EDA

In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')
randomstate = 1000

df = pd.read_csv('lendingclub.csv')
df.head()

   home_ownership  income    dti  fico  loan_status
0               1    43.0  39.66   670            0
1               1    80.0  39.54   685            1
2               0    30.0  39.52   695            1
3               1   105.0  39.45   710            0
4               0    28.6  39.28   680            1

In [7]:
df.replace(to_replace=' ', value=np.nan, inplace=True)
df.isna().sum() / len(df) * 100

home_ownership    0.0
income            0.0
dti               0.0
fico              0.0
loan_status       0.0
dtype: float64

In [14]:
df.describe()

       home_ownership       income          dti         fico  loan_status
count     2270.000000  2270.000000  2270.000000  2270.000000  2270.000000
mean         0.573568    74.058571    18.907824   692.504405     0.649339
std          0.494667    39.335066     8.460242    28.854947     0.477282
min          0.000000    20.000000     0.740000   660.000000     0.000000
25%          0.000000    46.000000    12.617500   670.000000     0.000000
50%          1.000000    65.000000    18.420000   685.000000     1.000000
75%          1.000000    92.000000    25.287500   705.000000     1.000000
max          1.000000   250.000000    39.660000   845.000000     1.000000

,count,mean,std,min,25%,50%,75%,max
home_ownership,2270.0,0.573568,0.494667,0.00,0.0000,1.00,1.0000,1.00
income,2270.0,74.058571,39.335066,20.00,46.0000,65.00,92.0000,250.00
dti,2270.0,18.907824,8.460242,0.74,12.6175,18.42,25.2875,39.66
fico,2270.0,692.504405,28.854947,660.00,670.0000,685.00,705.0000,845.00
loan_status,2270.0,0.649339,0.477282,0.00,0.0000,1.00,1.0000,1.00